testcases/service/LAC-TC-04-CalcLoanTerm-Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:loan="http://www.amortizer.org/LoanCalcService/">
   <soapenv:Header/>
   <soapenv:Body>
      <loan:CalcLoanTerm>
         <loanAmt>24950</loanAmt>      
         <loanRate>7.25</loanRate>
         <loanPmt>699.50</loanPmt>    
         <EmailPIN>""</EmailPIN>
      </loan:CalcLoanTerm>
   </soapenv:Body>
</soapenv:Envelope>